Repository: NONG-PHLOEUT-GITHUB/sports-venue-booking-app
Catalog: frontend/lib/l10n/app_*.arb
Languages: km

# appTitle
source: Sports Venue Booking App
km: កម្មវិធីកក់កន្លែងលេងកីឡា

source: Loading...
km: កំពុងផ្ទុក...

# btnSave
source: Save Change
km: រក្សាទុក

source: Send Code
km: ផ្ញើកូដ

# btnBookNow
source: Booking Now
km: កក់ឥឡូវនេះ

source: Register
km: ចុះឈ្មោះ

# loginTitle
source: Login Account
km: ចូលគណនី

# welcomeMessage
source: Hello, welcome back to account!
km: សួស្តី! សូមស្វាគមន៍ការទៅកាន់គណនីរបស់អ្នកវិញ!

# dontHaveAccount
source: Don’t have an account?
km: មិនទាន់មានគណនីទេ?

source: Sign Up
km: ចុះឈ្មោះ

# signInWith
source: Sign in with Google or Facebook
km: ចូលដោយប្រើ Google ឬ Facebook

source: Logout
km: ចាកចេញ

source: Profile
km: ពត៌មានផ្ទាល់ខ្លួន

source: Book Your Ground
km: កក់ទីលានរបស់អ្នក

source: Great Offers
km: ការផ្តល់ជូនដ៏អស្ចារ្យ

source: Edit Profile
km: កែប្រែព័ត៌មានផ្ទាល់ខ្លួន

source: Favorites
km: ចូលចិត្ត

source: Search
km: ស្វែងរក

# searchPlaceholder
source: Search by location, sport type, or date
km: ស្វែងរកតាមទីតាំង ប្រភេទកីឡា ឬកាលបរិច្ឆេទ

source: Venue Details
km: ព័ត៌មានលំអិតអំពីកន្លែង

source: Availability
km: មានក្នុងស្តុក

source: Amenities
km: សេវាកម្ម

source: Pricing
km: តម្លៃ

source: Reviews
km: មតិយោបល់

source: Add to Favorites
km: បន្ថែមទៅក្នុងចូលចិត្ត

source: Booking
km: ការកក់

source: Select Venue
km: ជ្រើសរើសកន្លែង

source: Select Date & Time
km: ជ្រើសរើសកាលបរិច្ឆេទ និងម៉ោង

source: Book Now
km: កក់ឥឡូវនេះ

# bookingSuccess
source: Booking Successful!
km: ការកក់បានជោគជ័យ!

source: Payment
km: ការទូទាត់

source: Pay Now
km: បង់ប្រាក់ឥឡូវនេះ

# paymentSuccess
source: Payment Successful!
km: ការទូទាត់បានជោគជ័យ!

# paymentFailure
source: Payment Failed
km: ការទូទាត់បរាជ័យ

source: English
km: ភាសាអង់គ្លេស

source: Khmer
km: ភាសាខ្មែរ

# changeLanguage
source: Language
km: ភាសា

source: Language Changed
km: ភាសាត្រូវបានផ្លាស់ប្តូរ

source: Confirm Booking
km: បញ្ជាក់ការកក់

source: Your Contact Info
km: ព័ត៌មានទំនាក់ទំនងរបស់អ្នក

source: Full Name
km: ឈ្មោះពេញ

# enterFullName
source: Enter your full name
km: បញ្ចូលឈ្មោះពេញរបស់អ្នក

source: Phone Number
km: លេខទូរស័ព្ទ

# email
source: Email Address
km: អាសយដ្ឋានអ៊ីមែល

# enterEmail
source: Enter your email
km: ប​​​​ញ្ចូលអាសយដ្ឋានអ៊ីមែលរបស់អ្នក

# enterPhoneNumber
source: Enter your phone number
km: បញ្ចូលលេខទូរស័ព្ទរបស់អ្នក

source: Booking Details
km: ព័ត៌មានការកក់

source: Select Field
km: ជ្រើសរើសទីលាន

source: Date
km: កាលបរិច្ឆេទ

source: Time
km: ម៉ោង

source: Total Price
km: តម្លៃសរុប

source: Notification
km: ការជូនដំណឹង

source: Home
km: ទំព័រដើម

# venue
source: Venue Details
km: ទីកន្លែង

source: Ticket
km: សំបុត្រ

source: Account
km: គណនី

# makeBooking
source: Let's make a booking
km: ចាប់ផ្ដើមការកក់ឥឡូវនេះ

source: Tutorial
km: មគ្គុទេសក៍

source: Language
km: ភាសា

source: Payment Options
km: ជម្រើសទូទាត់

source: Summary Information
km: ព័ត៌មានសង្ខេប

source: Name
km: ឈ្មោះ

source: Duration
km: ថ្លៃសេវា

source: Field
km: ទីលាន

source: Total Amount to pay :
km: ចំនួនសរុបត្រូវបង់៖

# pleaseSelectPayment
source: Please select a payment option
km: សូមជ្រើសរើសជម្រើសទូទាត់

# tapToPayWithABA
source: Tap to pay with ABA mobile
km: ចុចដើម្បីទូទាត់ជាមួយ ABA

# tapToPayWithACLEDA
source: Tap to pay with ACLEDA mobile
km: ចុចដើម្បីទូទាត់ជាមួយ ACLEDA

# tapToPayWithKHQR
source: Tap to pay with KHQR mobile
km: ចុចដើម្បីទូទាត់ជាមួយ KHQR

source: Credit/Debit card
km: កាតឥណទាន/ឥណពន្ធ

source: Check Out
km: បញ្ចប់ការទូទាត់

source: Payment Successful!
km: ការទូទាត់ជោគជ័យ!

# paymentThankYou
source: Thank you for payment. Your transaction has been processed successfully
km: សូមអរគុណសម្រាប់ការទូទាត់។ ប្រតិបត្តិការ​របស់​អ្នក​ត្រូវបាន​ដំណើរការ​ដោយជោគជ័យ

source: Return Home
km: ត្រឡប់ទៅទំព័រដើម

source: Verify
km: ផ្ទៀងផ្ទាត់

# didNotReceiveCode
source: Didn't receive code?
km: មិនទទួលបានកូដ?

source: Resend
km: ផ្ញើម្ដងទៀត

# enterVerificationCode
source: Enter the verification code we just sent on your email address or phone number.
km: សូមបញ្ចូលកូដដែលយើងបានផ្ញើទៅអាសយដ្ឋានអ៊ីមែលឬលេសទូរស័ព្ទរបស់អ្នក។

source: OTP Verification
km: ការផ្ទៀងផ្ទាត់ OTP

source: Credit Pay
km: បង់ដោយកាតឥណទាន

source: Card Name
km: ឈ្មោះកាត

source: Card Holder Name
km: ឈ្មោះអ្នកកាន់កាត

source: Expiry Date
km: ថ្ងៃផុតកំណត់

source: Helps & Supports
km: ជំនួយ & គាំទ្រ

source: Order History
km: ប្រវត្តិការកម្មង់

source: Change Password
km: ផ្លាស់ប្តូរពាក្យសម្ងាត់

source: Password
km: ពាក្យសម្ងាត់
